{"text":"So tell me, let’s start at the beginning.\n\nHow’d you get to Facebook in the beginning?\n\nSo I joined the company in the late summer of 2005.\n\nAt the time, I was an independent designer and developer working in San Francisco.\n\nAnd a project that I had shipped that summer caught some traction in the design community and won a couple of awards and somehow ended up on the plate of an early employee at the company.\n\nAnd so they reached out, because the web being the web as it was back then, and they reached out and they asked, “Hey, you live in San Francisco.\n\nWould you be interested in coming down to Palo Alto and meeting with us?”\n\nAnd they were persistent about it.\n\nThey were like, “Hey, you should, you know, hop on the Caltrain and come meet with us.”\n\nAnd anso one fateful day in September of that year, I hopped on the Caltrain, went down to Palo Alto for the first time, came to this office, and it was a bunch of folks who were like three years younger than I was.\n\nI felt like half of them were college dropouts and they were working on this service that I knew very little about.\n\nI understood it was in the social networking space.\n\nAnd it became quickly apparent to me that, one, they had very lofty aspirations or ambitions for this company that they were building.\n\nBut then two, they seemed a little bit too smart to be working on social networking.\n\nI kind of, when I thought of social networking, I thought about the incumbent[s] at the time – Myspace or Friendster.\n\nAnd so I didn’t quite understand how they had kind of amassed a group of, like, bona fide young technologists to work in this space.\n\nAnd when you say lofty ambitions what, how was it articulated at the time in terms of ambitions?\n\nYeah. So the ambitions were somewhat abstract and yet they kind of proved out to be true over time.\n\nIt was this idea that the world is made up of a system of relationships across people, organizations, entities.\n\nAnd if one were to build a graph or a way to map these relationships and start to weigh them, not only would you be able to accelerate information flow.\n\nThat was the terminology they used back then.\n\nBut their view was that they could potentially create a way for people to be able to share with the members of their community, with their family and friends, in a way that was unprecedented on the internet; in a way where they can manage the audience that they were speaking to and that would allow for them over time to be able to build a project that they were working on called “Feed.”\n\nFeed was a really simple idea.\n\nYou take all these structured relationships around the world and you show people the world’s events through the prism of their friends.\n\nAnd I thought this was such an interesting idea, an interesting concept.\n\nThey had no mock-ups for it.\n\nIt was just very much like an abstract notion.\n\nBut their view was that if you started to build this structured data set around what people cared about, who they’ve connected with, what kind of information you’re sharing, they could eventually build an advertising platform that could rival Google’s.\n\nAnd Google was no joke of a company back in 2005.\n\nAnd so I came away from that conversation thinking, wow, these cats are incredibly ambitious.\n\nI should check out the service and see how it maps that ambition.\n\nSo I asked my brother for his login.\n\nHe was — at the time I think he was a sophomore at Johns Hopkins and they had just released Facebook at Johns Hopkins.\n\nNote in 2005, Facebook was a college-only social network.\n\nI think it had 3 to 4 million users at the time.\n\nAnd I was a little bit let down because this was a version of Facebook that was pre-photos, pre-News Feed, pre-Like button, pre-commenting, pre-everything, essentially.\n\nAnd yet, it was really clear that they had built a service that was really topical, that had a tremendous amount of usage, and that had all the component parts to potentially realize this vision.\n\nAnd so they asked me, “Do you believe that someday this system that we just described will exist?”\n\nAnd I said, “Yeah, this just seems inevitable.\n\nThis seems like it’s the way the future will work.”\n\nAnd they asked a really simple question.\n\nThey asked, “Well, who’s going to build it?\n\nWhy not us?”\n\nAnd I came home thinking about it and I was like, yeah, why not them?\n\nWho will build this?\n\nThey reached out and they asked, “Hey, are you interested in potentially interviewing for a design role here?”\n\nAnd I said, “You know what, I’ll try this out for one year.\n\nSee what happens.”\n\nAnd one year became six.\n\nIn terms of the vision at the time, was there a sense that they wanted to create sort of a 21st century public space as well?\n\nI mean, in terms of a place where people connect and share, was that part of the ambition to be, like, the one place, something that kind of stands on its own?\n\nI think early on, if you look back on where Facebook was in that era, Facebook was sitting squarely in the shadows of an incumbent company called Myspace.\n\nAnd our ambitions at the time were: Can we stay alive as a company?\n\nRight? Can we demonstrate some relevance in a world where there appears to already be a winner in this category of product?\n\nAnd so for us there was a tremendous amount of urgency in, one, manifesting this idea for News Feed – seeing whether or not it actually had the kind of traction, the kind of market-product fit that we intuitively felt like it would; and then three, trying to get it to as many people as we possibly could.\n\nThe [Silicon] Valley is littered with the bodies of companies that were much further along than Facebook was back then.\n\nSo a big impetus for us was moving quickly enough to be able to realize that market opportunity.\n\nAt no point did we call it a public space for the 21st century.\n\nThat wasn’t really the language that we used at the time.\n\nI think it was more foundational.\n\nIt was this idea that today it’s difficult for people to share information with the folks that they’re closest with and to do so with the confidence that that information isn’t broadcasted to the entire planet.\n\nSo we were really focused on privacy, on these fixed, finite audiences, and making sure the people – anyone who signed up to the service – were able to find the folks that they were connected with in real life on the platform.\n\n… What was the competitive spirit inside of Facebook at that point?\n\nI mean, we were an ambitious company.\n\nI think that Facebook as a culture naturally attracted people who had this mix of competition, ambition, speed, a real desire to kind of show the world an alternative to Myspace.\n\nAnd more importantly, it was a group of people who were really mission-driven.\n\nThey genuinely believe that this mechanism didn’t exist in the world.\n\nAnd it needed to.\n\nAnd our intuition said this wasn’t, like, relevant [only] to college students.\n\nThis felt like it could be relevant to any person on the planet.\n\nAnd that sort of realization is somewhat profound and really guided a lot of the early design principles around building a product that was inherently universal.\n\nAnd so what does that mean – building a product that’s inherently universal?\n\nI mean, get into the story of what [were] some of the contributions you made.\n\nBut what does that mean?\n\nYeah.\n\nSo a product that’s inherently universal is, one, a product that’s accessible, that’s simple, that’s intuitive, that’s relevant to a really, really broad set of the population.\n\nAnd since Facebook wasn’t creating games, it wasn’t creating knickknacks for folks to interact with, it was really trying to create a conduit, a vessel for people to find the folks that they were connected with in real life, and having the tools and the power to be able to share the information that’s the most meaningful to them.\n\nWe felt like in order to build a universal product, we needed to adhere to a certain set of principles around like consistency, simplicity, a really spartan design; something that would not only differentiate us from what was out in the market today, these like self-designed Myspace pages, but then more importantly, it had to work from a technical standpoint.\n\nIt had to be really good at identifying the people who were potentially your friends and making sure that we were setting up an onboarding experience that would enable you to be able to actually connect and share with them.\n\nEngagement is a word we’ve heard a lot about, especially the early years and developing these tools and making this as engaging a site and essentially getting people to spend more time there on Facebook, what did that really mean to you and what you were designing?\n\nYeah.\n\nSo from an engagement standpoint, it sort of starts from the philosophy that people have things they want to share.\n\nThey often want to share things daily.\n\nThe meaningful relationships in their lives aren’t relationships that they periodically check in on, you know, once a month or, you know, once a year.\n\nIt’s something that has a cadence that’s ongoing.\n\nAnd so for us, we wanted to make sure that engagement on the platform served two purposes.\n\nOne, it matched that cadence of natural communication, talking about things that are happening today, giving people the ability to compulsively share a funny photo.\n\nOh, look, there’s some ducks outside my house.\n\nI should post a video of these ducks because they’re doing something funny and unique.\n\nBeing able to find the folks you really care about and catch up on what’s going on in the world.\n\nBut then two, you know, in practice we understood that engagement was one of the driving functions, one of the health metrics of the business.\n\nWe needed to make sure that the product was relevant.\n\nAnd so if the product’s not engaging people on a periodic basis, on a daily basis, it’s not likely to be relevant and it’s not likely to be a thriving business.\n\nIt’s been reported that in Friday meetings early on that [Facebook founder and CEO] Mark [Zuckerberg] used to end the meetings by saying “domination.”\n\nIs that true?\n\nThat is true.\n\nSo tell me about that.\n\nWhat were those Friday meetings and what did that mean? Domination?\n\nI mean, I can only speak to my experience.\n\nPart of it was the rallying of the troops against what most people in the industry might perceive as a product or company that might be dead on arrival.\n\nAgain, you sort of look back and consider Facebook and where it was relative to Myspace, which I think was on the order of like 60 times larger than Facebook from a user standpoint.\n\nWe were the insurgents.\n\nWe were the ones that had everything to lose.\n\nAnd I think that the notion of domination was guided by this idea of rallying the troops towards making steady, continuous progress towards a strategy that we felt like could potentially win, and that wouldn’t be fully realized in a single quarter or even in a single year.\n\nIt was going to be a multiyear effort.\n\nBut if we were able to capitalize on that opportunity, we felt like we might be able to build a product that would have meaningful influence on how people lived.\n\nAnd I certainly wasn’t thinking that it would be on the order of billions of people.\n\nThe smartphone had not yet been invented by that stage.\n\nBut I think, you know, the spirit of domination was really around this idea of like rallying a competitive spirit against what was, on paper, a clearly grim situation.\n\nI know we’re limited, so the Like button.\n\nI just need to hear about the genesis of that and ask you a couple of questions about that.\n\nSo how did that come about?\n\nSo the Like button was a feature that we had in what I like to call product purgatory for, I think, multiple years.\n\nWe had started working on it in the summer of 2007.\n\nA team had gotten together for Hackathon, built an initial prototype.\n\nBut it always somehow never ended up going to production because the design wasn’t quite there.\n\nIt often flunked the Zuck review before it went out to market.\n\nAnd we weren’t able to kind of reach a final design that we felt like was cohesive with the broader product.\n\nIn late 2008, I started working on what ended up being a major redesign of News Feed that introduced in-line commenting.\n\nI think most people forget that commenting in News Feed was not a thing for several years of News Feed’s history.\n\nBut we wanted to make News Feed the actual conduit for interactions on Facebook where you can spend your whole time, your whole session, on News Feed and get a tremendous amount of value out of it and also be able to converse with the people around you.\n\nAnd as part of that program, which we call the Universal Feedback Interface, we had sort of set the stage for finally releasing the Like button.\n\nAt the time, we were a little bit skeptical about the Like button.\n\nWe were concerned that the Like button would cannibalize commenting, that it would start to erode engagement because people would just resort to clicking a Like button, not talking to the people in their community.\n\nAnd as it turned out, our intuition was just dead wrong.\n\nWe ran these experiments.\n\nWe kind of launched the Like button in these controlled, self-contained networks to see what the usage would look like relative to the broader user base.\n\nAnd what we found was that the Like button acted as a social lubricant.\n\nIt actually increased the likelihood of a comment if there were Likes on a particular post.\n\nAnd of course, it was also driving this flywheel of engagement that people felt like they were heard on the platform whenever they shared something.\n\nAnd so what we found was that we struck a chord of meaning that I don’t think any of us really had fully internalized would be the case.\n\nI mean, the Like button was one of a thousand things that I worked on at Facebook.\n\nBut it somehow ended up being this cultural staple and it became like a driving force for the product.\n\nWas it something that you all considered at the time – there’s been much more recent criticism of things like the Like button and the sort of addictive nature of social media and Facebook in particular, and that the Like button is a dopamine release every time you click on something or every time you get a Like.\n\nWere you guys thinking at the time about how do we kind of addict people?\n\nNo.\n\nThere was no addiction metric or anything to that extent.\n\nBut was engagement addiction to some degree?\n\nNo.\n\nI mean, again, it presumes that people are finding that the product is relevant to them.\n\nAnd what we were focused on was: How do we make a product globally relevant?\n\nAgain, this is an era in which the smartphone – it was not clear yet, like, how much larger the total addressable market would grow as a result of the smartphone.\n\nIt was not clear like how Facebook would survive inevitable competition from Google and all the whispers we heard about them launching a competing product and the sheer amount of distribution that they enjoyed.\n\nFor us, the key focus was building a company that was going to be relevant and that was not a foregone conclusion, certainly not in the time that we were developing those products.\n\n… Do you look back and it’s sort of like, wow, be careful what you wish for here in terms of wanting to be the social network that connects everybody?\n\nThat you didn’t necessarily think about the attendant risks of what it means to connect 2.2 billion people?\n\nYeah.\n\nI mean, there’s a lot of mistakes that were made along the way that can be, you know, that are clearly regrettable.\n\nA lot of edge cases and scenarios that we certainly didn’t anticipate.\n\nWe didn’t anticipate that foreign actors would use Facebook to coordinate a campaign to influence an election.\n\nBut then again, neither did people in the U.S. government or folks who similarly had the potential to stop it.\n\nThat, again, wasn’t like a high-level priority for us.\n\nIt wasn’t a scenario that we had really considered.\n\nInstead, we were much more focused on: How do we make this product universally available, because we felt that the value, the good that it brought into the world, would far exceed these edge cases or methods through which people can use it for evil.\n\nSo was there a concern at the time because [in] 2011, “The Filter Bubble,” Eli Pariser’s book, comes out, right?\n\nIt’s not as if there weren’t people already talking about the idea that engagement-driven algorithms could have major effects on what information people are exposed to; how people saw the world and echo chambers and all sorts of concerns like that.\n\nWas that criticism or those concerns permeating the walls of Facebook?\n\nI think to an extent, you know, they’re being heard.\n\nBut again, at the time the company was trying to solve for mobile advertising.\n\n… It was solving for its own existence and making sure that the product was relevant.\n\nIt was solvent for problems that were much more foundational.\n\nAnd it would be presumptuous to think that like, oh, this was already a fully-realized, fully-optimized interface.\n\nIt certainly wasn’t.\n\nPeople were not necessarily finding their friends on Facebook.\n\nPeople were not necessarily finding information that they really cared about or found engaging whatsoever.\n\nBut I think that it’s now clear in hindsight that there were these anti-patterns that started to emerge when the bulk of a person’s community reflected either an ideology or a set of inputs that are specific to that community, and that kind of squeezed out or left little room for information outside of what that community sees and believes.\n\nBut again, I think it’s important to look back and consider that the genesis of News Feed was this idea that people don’t have access to the information that’s personal, that comes from their friends and their family.\n\nAnd that, in and of itself, we thought would have universal appeal and would create a lot of social good and social value to people all over the world.\n\n… I think it’s easy to overlook how quickly Facebook reacts or has historically reacted to pushback from the community when it launches features that were either not well-considered or that didn’t map to what people actually wanted.\n\nAnd you know, the one that kind of like sits in the lore of the company is when we first launched News Feed; and just the shear amount of blowback that was kind of self-perpetuated by News Feed from the user base at that time where people didn’t understand why this feature was released, who can see what.\n\nThere was no onboarding experience that we had built when we released it.\n\nWe just pressed go.\n\nAnd more importantly, there was real concerns around I feel like my privacy’s being invaded.\n\nI can’t articulate why, but I feel as though there’s a betrayal of trust.\n\nWe didn’t sit on our hands back then.\n\nWe spun up a task force to try to identify what are the specific concerns people are expressing.\n\nWhat are the features and controls that we need to give to people so that they feel like they have some agency over the information that’s being shared over News Feed?\n\nAnd then we launched a whole new set of controls within, like, five business days of the News Feed launch.\n\nThere were engineers working around the clock to solve for this because we felt like beyond it being a potential existential crisis for the product, there was a real sense of duty to the user base and a sense of responsibility for launching that feature and getting that kind of response.\n\nThat’s been a really consistent thread with this company for as long as I’ve known it.\n\n… I mean, you were a much smaller company back then.\n\nAnd when you grow to a scale of 2.2 billion and you’ve got major problems that develop all over the world in all sorts of languages, do you think the company’s been responsive, and can be responsive at that type of scale?\n\nI think that it’s starting to show that at this scale, it is challenging to be speedy and hasty with responding to the kinds of problems that may emerge supporting a user base of that scope.\n\nBut it’s not for lack of desire or lack of integrity or because some profit-seeking motive is in the way."}